Public Attributes | List of all members
API_ModelViewOptionsType Struct Reference
Project Navigator
Representation of the model view options. More...
#include <APIdefs_ViewSettings.hpp>
 Public Attributes
 API_ModelViewOptions_Head  | head
general information of the given MVO
 API_ModelViewOptions  | modelViewOpt
details of the given MVO
Detailed Description
Representation of the model view options.
Remarks
These settings correspond to the relevant items in the Model View Options menu. Call the ACAPI_Navigator_ModelViewOptions_Search or the ACAPI_Navigator_ModelViewOptions_Get functions to operate on this data.